src/Catalogs/Базы/Базы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Базы</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>КластерСерверов</name>
    <type>
      <types>CatalogRef.Кластеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипSQL</name>
    <type>
      <types>EnumRef.ТипыSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяSQL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноФиксироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.ТипыБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКХранилищу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/РежимыРаботыКонфигурации/РежимыРаботыКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыРаботыКонфигурации</name>
  <enumValues>
    <name>ibcmd</name>
  </enumValues>
  <enumValues>
    <name>Пакетный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыБаз/ТипыБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБаз</name>
  <enumValues>
    <name>РабочаяБаза</name>
  </enumValues>
  <enumValues>
    <name>ТестоваяБаза</name>
  </enumValues>
  <enumValues>
    <name>ППР</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <predefined>
    <items>
      <name>Неопределен</name>
      <description>Неопределен</description>
    </items>
  </predefined>
  <attributes>
    <name>Репозиторий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПроектаРепозитория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PathGitClone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимыРаботыКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСборкиРелиза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевШара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьКонфигурациюВРелиз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяJobJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаАктуальныхОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляАктуализацииОбработок</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаРасширенийДляАктуализацииОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРепозитория</name>
    <type>
      <types>EnumRef.ТипРепозитория</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаскТрекер</name>
    <type>
      <types>CatalogRef.ТаскТрекеры</types>
    </type>
  </attributes>
  <attributes>
    <name>URLТаскТрекера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <attributes>
    <name>ИмяАгентаБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАгентаJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКШаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПапкеДевопс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапускаOscript</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогRAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсииПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКСерверуRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Базы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НастройкиБазы(База) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Базы.Ссылка КАК База,
		|	Базы.Наименование КАК Наименование,
		|	Базы.ИмяИнформационнойБазы КАК ИмяИнформационнойБазы,
		|	Базы.НомерВерсииПлатформы КАК НомерВерсииПлатформы,
		|	Базы.ИмяПользователяИнформационнойБазы КАК ИмяПользователяИнформационнойБазы,
		|	Базы.ПарольПользователяИнформационнойБазы КАК ПарольПользователяИнформационнойБазы,
		|	ПРЕДСТАВЛЕНИЕ(Базы.ТипSQL) КАК ТипSQL,
		|	Базы.ИмяSQL КАК ИмяSQL,
		|	Базы.ЛогинSQL КАК ЛогинSQL,
		|	Базы.ПарольSQL КАК ПарольSQL,
		|	Базы.КаталогRAS КАК КаталогRAS,
		|	ЕСТЬNULL(Проекты.Репозиторий, """") КАК Репозиторий,
		|	ЕСТЬNULL(Проекты.ИДПроектаРепозитория, """") КАК ИДПроектаРепозитория,
		|	ЕСТЬNULL(Проекты.PathGitClone, """") КАК PathGitClone,
		|	ЕСТЬNULL(Проекты.РежимРаботыКонфигурации, ЗНАЧЕНИЕ(Перечисление.РежимыРаботыКонфигурации.Пакетный)) КАК РежимРаботыКонфигурации,
		|	Базы.ТипБазы = ЗНАЧЕНИЕ(Перечисление.ТипыБаз.РабочаяБаза) КАК ЭтоРабочаяБаза,
		|	ЕСТЬNULL(Кластеры.Наименование, """") КАК КластерСерверов,
		|	ЕСТЬNULL(Кластеры.ИмяАгентаБазы, """") КАК ИмяАгентаБазы,
		|	ЕСТЬNULL(Кластеры.ИмяАгентаJenkins, """") КАК ИмяАгентаJenkins,
		|	ЕСТЬNULL(Кластеры.ПутьКПапкеДевопс, """") КАК ПутьКПапкеДевопс,
		|	ЕСТЬNULL(Кластеры.ПутьКШаре, """") КАК ПутьКШаре,
		|	ЕСТЬNULL(Кластеры.ФайлЗапускаOscript, """") КАК ФайлЗапускаOscript,
		|	ЕСТЬNULL(Кластеры.ПутьКПапкеДевопс, """") + ""\Repositories"" КАК РепозиторийБазы,
		|	ЕСТЬNULL(Кластеры.ПутьКШаре, """") + ""\Repositories\"" КАК РепозиторийБазыШара,
		|	ЕСТЬNULL(Кластеры.ПутьКПапкеДевопс, """") + ""\Repositories\"" + Базы.ИмяИнформационнойБазы КАК КаталогБазы,
		|	ЕСТЬNULL(Кластеры.ПутьКПапкеДевопс, """") + ""\Repositories\"" + ""devops"" КАК КаталогDevops,
		|	ЕСТЬNULL(Кластеры.ПутьКШаре, """") + ""\Repositories\"" + ""devops"" КАК КаталогDevopsШара,
		|	ЕСТЬNULL(Кластеры.ПутьКШаре, """") + ""\Repositories\"" + Базы.ИмяИнформационнойБазы КАК КаталогБазыШара,
		|	ЕСТЬNULL(Кластеры.ПутьКШаре, """") + ""\Repositories\"" + Базы.ИмяИнформационнойБазы + ""\build\epf"" КАК КаталогСборкиОбработок,
		|	Базы.Владелец КАК Проект,
		|	ЕСТЬNULL(Проекты.КаталогСборкиРелиза, """") КАК КаталогСборкиРелиза,
		|	ЕСТЬNULL(Проекты.СобиратьКонфигурациюВРелиз, ЛОЖЬ) КАК СобиратьКонфигурациюВРелиз,
		|	ЕСТЬNULL(Проекты.ИмяПользователяJenkins, """") КАК ИмяПользователяJenkins,
		|	ЕСТЬNULL(Проекты.ПарольJenkins, """") КАК ПарольJenkins,
		|	ЕСТЬNULL(Проекты.ТокенJenkins, """") КАК ТокенJenkins,
		|	ЕСТЬNULL(Проекты.URLJenkins, """") КАК URLJenkins,
		|	ЕСТЬNULL(Проекты.ИмяJobJenkins, """") КАК ИмяJobJenkins,
		|	Базы.ПутьКХранилищу КАК ПутьКХранилищу,
		|	Базы.ПользовательХранилища КАК ПользовательХранилища,
		|	ЕСТЬNULL(Кластеры.СерверПубликации, """") КАК СерверПубликации,
		|	Базы.БазаПубликации КАК БазаПубликации,
		|	Базы.ПутьКХранилищуToolsWorld КАК ПутьКХранилищуToolsWorld,
		|	Базы.ПользовательХранилищаToolsworld КАК ПользовательХранилищаToolsworld,
		|	Базы.ПутьКХранилищуAelita КАК ПутьКХранилищуAelita,
		|	Базы.ПользовательХранилищаAelita КАК ПользовательХранилищаAelita
		|ИЗ
		|	Справочник.Базы КАК Базы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО Базы.Владелец = Проекты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кластеры КАК Кластеры
		|		ПО Базы.КластерСерверов = Кластеры.Ссылка
		|ГДЕ
		|	Базы.Ссылка = &База";
	
	Запрос.УстановитьПараметр("База", База);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);	
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
КонецФункции

Функция БазаТекущегоПользователя(ТекущийПользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Базы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Базы КАК Базы
	|ГДЕ
	|	Базы.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Ответственный", ?(ТекущийПользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, ТекущийПользователь));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

// Функция - Базы по типу базы
//
// Параметры:
//  ТипБазы	 - ПеречислениеСсылка.ТипыБаз
// 
// Возвращаемое значение:
//   Массив 
//
Функция БазыПоТипуБазы(ТипБазы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Базы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Базы КАК Базы
	               |ГДЕ
	               |	Базы.ТипБазы = &ТипБазы";
	
	Запрос.УстановитьПараметр("ТипБазы", ТипБазы);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ЮРЛАгентаБазы(База) Экспорт
	
	//todo - вынести кластер в отдельные справочники
	Кластер = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(База, "КластерСерверов.Наименование, КластерСерверов.ИмяАгентаБазы");
	Возврат СтрШаблон("http://%1/%2/hs/run", Кластер.КластерСерверовНаименование, Кластер.КластерСерверовИмяАгентаБазы);
	
КонецФункции

Функция БазыПоПроекту(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Базы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Базы КАК Базы
	               |ГДЕ
	               |	Базы.Владелец = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ОбновитьКли(База) Экспорт
	
	ПараметрыБазы = РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	
	КаталогРепозиторияСуществует = РаботаСGit.КаталогРепозиторияСуществует(ПараметрыБазы.КаталогDevopsШара);
	
	Если Не КаталогРепозиторияСуществует Тогда
		РаботаСGit.СоздатьКаталогРепозитория(ПараметрыБазы.РепозиторийБазыШара);
		ПутьКРепозиториюDevCLI = Константы.ПутьКРепозиториюDevCLI.Получить();
		РаботаСGit.КлонироватьРепозиторий(База, ПараметрыБазы.РепозиторийБазы, ПутьКРепозиториюDevCLI);
	Иначе
		РаботаСGit.ОбновитьРепозиторийИзУдаленного(База, ПараметрыБазы.КаталогDevops);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЛоговПингаБазы(База) Экспорт
		
	ДанныеЛогов = РаботаСGit.ДанныеЛоговПингаБазы(База);
	Возврат ДанныеЛогов;
		
КонецФункции

Процедура ДобавитьКаталог(База) Экспорт
	
	ПараметрыБазы = РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	РаботаСGit.СоздатьКаталогРепозитория(ПараметрыБазы.КаталогБазыШара);
	РаботаСGit.СоздатьКаталогРепозитория(ПараметрыБазы.ПутьКШаре + "\Логи");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
